---
kind: type
id: T:Autodesk.Revit.DB.Visual.Asset
source: html/598e104b-b6ec-9ebe-7a93-ec96b8cbeba9.htm
---
# Autodesk.Revit.DB.Visual.Asset

Represents a connected property of material.

## Syntax (C#)
```csharp
public class Asset : AssetProperties
```